$('#myJD').addDropdown({
    href: '#',
    title: "我的京东",
    width: 126,
    menuList: [{
        title: "",
        items: [{
            href: '#',
            name: '待处理订单',
        }, {
            href: '#',
            name: '消息',
        }, {
            href: '#',
            name: '返修退换货',
        }, {
            href: '#',
            name: '我的问答',
        }, {
            href: '#',
            name: '降价商品',
        }, {
            href: '#',
            name: '我的关注',
        }],
    }, {
        title: '',
        items: [{
            href: '#',
            name: '我的京豆',
        }, {
            href: '#',
            name: '我的优惠券',
        }, {
            href: '#',
            name: '我的白条',
        }],
    }]
});

$('#procurement').addDropdown({
    title: '企业采购',
    width: 56,
    menuList: [{
        title: '',
        items: [{
            href: '',
            name: '企业购'
        }, {
            href: '',
            name: '商用场景馆'
        }, {
            href: '',
            name: '工业品'
        }, {
            href: '',
            name: '礼品卡'
        }]
    }]
});


$('#service').addDropdown({
    title: '客户服务',
    width: 70,
    menuList: [{
        title: '客户',
        items: [{
            name: '帮助中心',
            href: ''
        }, {
            name: '售后服务',
            href: ''
        }, {
            name: '在线客服',
            href: '',
        }, {
            name: '意见建议',
            href: ''
        }, {
            name: '电话客服',
            href: ''
        }, {
            name: '客服邮箱',
            href: ''
        }, {
            name: '金融咨询',
            href: ''
        }, {
            name: '全球售客服'
        }]
    }, {
        title: '商户',
        items: [{
            name: '合作招商'
        }, {
            name: '学习中心'
        }, {
            name: '商家后台'
        }, {
            name: '京麦工作台'
        }, {
            name: '商家帮助'
        }, {
            name: '规则平台'
        }]
    }]
});

$('#bar-navs').addDropdown({
    title: '网站导航',
    direction: 'x',
    menuList: [{
        title: '特色主题',
        width: 340,
        itemWidth: 85,
        items: [{
            name: '京东试用'
        }, {
            name: '京东金融'
        }, {
            name: '全球售'
        }, {
            name: '国际站'
        }, {
            name: '京东会员'
        }, {
            name: '京东预售'
        }, {
            name: '买什么'
        }, {
            name: '俄语站'
        }, {
            name: '装机大师'
        }, {
            name: '0元评测'
        }, {
            name: '港澳售'
        }, {
            name: '优惠券'
        }, {
            name: '秒杀闪购'
        }, {
            name: '印尼站'
        }, {
            name: '京东金融科技'
        }, {
            name: '陪伴计划'
        }, {
            name: '出海招商'
        }, {
            name: '拍拍'
        }]
    }, {
        title: '特色主题',
        width: 270,
        itemWidth: 85,
        items: [{
            name: '京东试用'
        }, {
            name: '京东金融'
        }, {
            name: '全球售'
        }, {
            name: '国际站'
        }, {
            name: '京东会员'
        }, {
            name: '京东预售'
        }, {
            name: '买什么'
        }, {
            name: '俄语站'
        }, {
            name: '装机大师'
        }, {
            name: '0元评测'
        }, {
            name: '港澳售'
        }, {
            name: '优惠券'
        }, {
            name: '秒杀闪购'
        }, {
            name: '印尼站'
        }]
    }]
});


var menuList = [{
    title: ['家用电器'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务', '企业采购', '商用电器', '以旧换新'],
        subs: [{
            title: '电视',
            items: ["曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件", "曲面电视", "超薄电视", "OLED电视", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        }, {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新"]
        }, {
            title: '洗衣机',
            items: ["滚筒洗衣机", "洗烘一体机", "波轮洗衣机", "迷你洗衣机", "烘干机洗衣机配件"]
        }, {
            title: '冰箱',
            items: ["多门对开门三门双门冷柜", "冰吧酒柜冰箱配件"]
        }, {
            title: '厨卫大电',
            items: ["油烟机", "燃气灶", "烟灶套装", "集成灶消毒柜", "洗碗机", "电热水器", "燃气热水器", "空气能热水器", "太阳能热水器", "嵌入式厨电烟机", "灶具配件"]
        }, {
            title: '厨房小电',
            items: ["破壁机", "电烤箱", "电饭煲", "电压力锅", "电炖锅", "豆浆机", "料理机", "咖啡机", "电饼铛", "榨汁机", "原汁机电水壶", "热水瓶", "微波炉", "电热饭", "盒电火锅", "养生壶", "电磁炉", "面包机", "空气炸锅", "面条机", "电陶炉", "煮蛋器", "电烧烤炉"]
        }, {
            title: '生活电器',
            items: ["电风扇", "冷风扇", "空气净化器", "吸尘器", "除螨仪", "扫地机器人", "除湿机", "干衣机", "蒸汽拖把", "拖地机", "挂烫机", "熨斗", "电话机", "饮水机", "净水器", "取暖器", "加湿器", "毛球修剪器", "生活电器配件"]
        }, {
            title: '个护健康',
            items: ["剃须刀", "电动牙刷", "电吹风", "美容仪", "洁面仪", "按摩器", "健康秤", "卷直发器", "剃脱毛器", "理发器", "足浴盆", "足疗机", "按摩椅"]
        }]
    }
}, {
    title: ['手机', '运营商', '数码'],
    content: {
        tabs: ['玩3C', '手机频道', '网上营业厅', '配件频道', '智能数码', '影像Club'],
        subs: [{
            title: '手机通讯',
            items: ["手机", "游戏手机", "5G手机", "拍照手机", "全面屏手机", "老人机", "对讲机", "以旧换新手机", "维修"]
        }, {
            title: '运营商',
            items: ["合约机", "手机卡", "宽带充话费流量", "中国电信", "中国移动", "中国联通", "京东通信", "挑靓号"]
        }, {
            title: '手机配件',
            items: ["手机壳", "贴膜", "手机存储卡", "数据线", "充电器", "手机耳机创意配件", "手机饰品", "手机电池", "苹果周边", "移动电源", "蓝牙耳机", "手机支架", "拍照配件"]
        }, {
            title: '摄影摄像',
            items: ["数码相机", "微单相机", "单反相机", "拍立得", "运动相机", "摄像机", "镜头", "户外器材", "影棚器材", "冲印服务", "数码相框"]
        }, {
            title: '数码配件',
            items: ["存储卡", "三脚架", "云台相机包", "滤镜闪光灯", "手柄相机清洁", "贴膜机身", "附件镜头", "附件读卡器", "支架电池", "充电器"]
        }, {
            title: '影音娱乐',
            items: ["耳机", "耳麦音箱", "音响", "智能音箱", "收音机", "麦克风MP3", "MP4", "专业音频", "音频线"]
        }, {
            title: '智能设备',
            items: ["智能手环", "智能手表", "智能眼镜", "智能机器人", "运动跟踪器", "健康监测", "智能配饰", "智能家居", "体感车", "无人机"]
        }]
    }
}, {
    title: ['电脑', '办公'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['家居', '家具', '家装', '厨具'],
    content: {
        tabs: ['家装城', '居家日用', '精品家具', '家装建材', '国际厨具', '装修服务'],
        subs: [{
            title: '厨具',
            items: ["水具", "酒具", "烹饪锅具", "炒锅", "碗碟套装", "厨房配件", "刀剪菜板锅具套装", "茶具", "咖啡具", "保温杯", "厨房置物架"]
        }, {
            title: '家纺',
            items: ["四件套", "被子", "枕芯", "毛巾", "浴巾", "蚊帐", "凉席", "地毯", "地垫", "床垫", "床褥", "毯子", "抱枕", "靠垫", "窗帘/窗纱", "床单", "床笠", "被套", "枕巾", "枕套", "沙发垫套", "坐垫", "桌布罩件", "蚕丝被", "乳胶枕"]
        }, {
            title: '生活日用',
            items: ["收纳用品", "雨伞", "雨具", "净化除味浴室用品", "洗晒", "熨烫缝纫", "针织用品", "保暖", "防护", "清洁工具"]
        }, {
            title: '家装软饰',
            items: ["装饰字画", "装饰摆件", "手工", "十字绣", "相框", "照片墙墙贴", "装饰贴", "花瓶", "花艺", "香薰蜡烛", "节庆饰品", "钟饰帘艺", "隔断创意", "家居3D立体墙贴", "玻璃贴纸", "电视背景墙", "电表箱", "装饰画"]
        }, {
            title: '灯具',
            items: ["吸顶灯", "吊灯", "台灯", "筒灯", "射灯", "庭院灯", "装饰灯", "LED灯", "氛围照明落地灯", "应急灯", "手电节能灯", ""]
        }, {
            title: '家具',
            items: ["客厅", "卧室", "餐厅", "书房", "儿童储物", "办公家具", "阳台", "户外电脑桌", "电视柜", "茶几", "办公柜", "进口/原创沙发", "床垫", "餐桌", "衣柜", "书架", "鞋柜", "置物架", "电脑椅", "晾衣架", "儿童床", "儿童桌椅", "红木"]
        }, {
            title: '全屋定制',
            items: ["定制衣柜", "榻榻米", "橱柜门", "室内门", "防盗门窗", "淋浴房", "壁挂炉", "散热器"]
        }, {
            title: '建筑材料',
            items: ["油漆涂料", "涂刷辅料", "瓷砖地板", "壁纸强化", "地板美缝剂", "防水涂料", "管材管件", "木材", "板材"]
        }, {
            title: '厨房卫浴',
            items: ["水槽", "龙头", "淋浴花洒", "马桶", "智能马桶", "智能马桶盖", "厨卫挂件", "浴室柜", "浴霸集成吊顶", "垃圾处理器"]
        }, {
            title: '五金电工',
            items: ["指纹锁", "电动工具", "手动工具", "测量工具", "工具箱", "劳防用品", "开关", "插座", "配电箱", "断路器", "机械锁", "拉手"]
        }]
    }
}, {
    title: ['男装', '女装', '童装', '内衣'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['美妆', '个护清洁', '宠物'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['女鞋', '箱包', '钟表', '珠宝'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['男鞋', '运动', '户外'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['房产', '汽车', '汽车用品'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['母婴', '玩具乐器'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['食品', '酒类', '生鲜', '特产'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['艺术', '礼品鲜花', '农资绿植'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['医药保健', '计生情趣'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['图书', '文娱', '教育', '电子书'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['机票', '酒店', '旅游', '生活'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['理财', '众筹', '白条', '保险'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['安装', '维修', '清洗', '二手'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}, {
    title: ['工业品'],
    content: {
        tabs: ['电脑办公', '企业采购', 'GAME+', '装机大师', '企业租赁'],
        subs: [{
            title: '电脑整机',
            items: ["笔记本", "游戏本", "平板电脑", "台式机一体机", "服务器", "工作站"]
        }, {
            title: '电脑配件',
            items: ["显示器", "CPU主板", "显卡", "硬盘", "内存机箱", "电源", "散热器", "显示器", "支架刻录机", "光驱声卡", "扩展卡", "装机配件", "SSD固态硬盘", "组装电脑", "USB", "分线器", "主板", "CPU套装"]
        }, {
            title: '外设产品',
            items: ["鼠标", "键盘", "键鼠套装", "网络仪表仪器", "U盘", "移动硬盘", "鼠标垫", "摄像头", "线缆", "手写板", "硬盘盒", "电脑工具", "电脑清洁", "UPS电源插座", "平板电脑配件", "笔记本配件"]
        }, {
            title: '游戏设备',
            items: ["游戏机", "游戏耳机", "手柄", "方向盘", "游戏软件", "游戏周边"]
        }, {
            title: '网络产品',
            items: ["路由器", "网络机顶盒", "交换机", "网络存储网卡", "5G/4G上网网线", "网络配件"]
        }, {
            title: '办公设备',
            items: ["投影机", "投影配件", "打印机", "传真设备", "验钞/点钞机", "扫描设备", "复合机碎纸机", "考勤门禁", "收银机", "会议音频视频", "保险柜", "装订/封装机", "安防监控", "白板"]
        }, {
            title: '文具',
            items: ["笔类本册", "便签", "办公文具", "文件收纳", "学生文具", "计算器", "画具", "画材", "财会用品", "文房四宝"]
        }, {
            title: '耗材',
            items: ["硒鼓", "墨粉", "墨盒", "色带", "纸类刻录光盘"]
        }]
    }
}];

// 创建左侧导航条元素
function createMenuDom(menuList) {
    //     <li>
    //     <a href="#">家用电器</a>
    // </li>
    // <li>
    //     <a href="#">手机</a>
    //     <span>/</span>
    //     <a href="#">运营商</a>
    // </li>
    // 添加导航条内dom元素
    menuList.forEach(function(liData) {
        var oLi = $('<li></li>');
        var title = liData.title;
        // 添加导航条每行的tab数据
        for (var i = 0; i < title.length; i++) {
            $('<a href="#">' + title[i] + '</a>').appendTo(oLi);
            if (i != title.length - 1) {
                $('<span>/</span>').appendTo(oLi);
            }
        }
        $('#menu-list').append(oLi);
    });
}

createMenuDom(menuList);

var timer = null;
// 左侧导航列表添加鼠标移入事件
function bindMenuEvent() {
    $('#menu-list').on('mouseenter', 'li', function(e) {
        clearTimeout(timer);
        $(this).css({
            backgroundColor: '#eee',
        });
        var index = $(this).index();
        renderMenuContent(menuList[index].content);
        $('#menu-content').show();
    }).on('mouseleave', 'li', function(e) {
        $(this).css({
            backgroundColor: '#fff',
        });
        timer = setTimeout(function() {
            $('#menu-content').hide();
        }, 500)
    });
    $('#menu-content').on('mouseenter', function() {
        clearTimeout(timer);
    }).on('mouseleave', function() {
        timer = setTimeout(function() {
            $('#menu-content').hide();
        }, 500)
    })
}
// 渲染左侧导航对应的内容区
function renderMenuContent(data) {
    // <ul class="tabs">
    //     <li>家电馆</li>
    //     <li>镇乡专卖店</li>
    //     <li>家电服务</li>
    // </ul>
    // <div class="item-content">
    //     <dl>
    //         <dt>电视</dt>
    //         <dd>
    //             <a href="#">曲面电视</a>
    //             <a href="#">超薄电视</a>
    //             <a href="#">OLED电视</a>
    //             <a href="#">4K超清电视</a>
    //             <a href="#">55英寸</a>
    //             <a href="#">65英寸</a><a href="#">电视配件</a></dd>
    //     </dl>
    // </div> 
    $('#menu-content').html('');
    var tabs = data.tabs;
    var subs = data.subs;
    var oUl = $('<ul class="tabs"></ul>');
    var itemContentDiv = $('<div class="item-content"></div>');
    tabs.forEach(function(item) {
        $('<li>' + item + '</li>').appendTo(oUl);
    });
    subs.forEach(function(item) {
        var oDl = $('<dl></dl>');
        $('<dt>' + item.title + '</dt>').appendTo(oDl);
        var oDd = $('<dd></dd>');
        item.items.forEach(function(ele) {
            $('<a href="#">' + ele + '</a>').appendTo(oDd);
        });
        oDl.append(oDd).appendTo(itemContentDiv);
    });
    $('#menu-content').append(oUl).append(itemContentDiv);

}

bindMenuEvent();


$('#swiper').swiper({
    imgList: ['https://img30.360buyimg.com/pop/s1180x940_jfs/t1/136056/22/11129/98208/5f72e84bE7dadc57c/d677117b3a22b307.png.webp',
        'https://img12.360buyimg.com/pop/s1180x940_jfs/t1/149454/36/9251/92742/5f6e8c4bEcad4b377/15ca2e425a024a29.jpg.webp',
        'https://img13.360buyimg.com/seckillcms/s260x260_jfs/t1/121905/12/1131/117305/5eba35a3E1ebbde69/1f988aadf9eac7b6.jpg.webp',
        'https://img20.360buyimg.com/seckillcms/s280x280_jfs/t1/150468/9/1988/56832/5f756654Eed2835e7/0948554afeabd869.jpg.webp',
        'https://img13.360buyimg.com/seckillcms/s280x280_jfs/t1/127777/34/13766/162522/5f72ff9aE21d20246/a6bfee9e14a4f4ae.jpg.webp'
    ],
    isAuto: true,
    animateType: 'fade'

});
// 右侧图标鼠标移入切换事件
function bindShowServiceEvent() {
    $('.item-frame').on('mouseenter', function(e) {
        $('.item-frame').removeClass('active');
        $('.service').addClass('service-extend');
        $(this).addClass('active');

    });
}
bindShowServiceEvent();
// 右侧图标区域点击关闭按钮切换图标
$('#close').click(function() {
    $('.item-frame').removeClass('active');
    $('.service').removeClass('service-extend');
    $('.item-frame').off('mouseenter');
    setTimeout(function() {
        bindShowServiceEvent();
    }, 600)
});


// 搜索按钮的点击事件 
$('.search-btn').click(function() {
    var val = $('#search-inp').val()
    $.ajax({
        url: 'https://suggest.taobao.com/sug',
        data: {
            code: 'utf-8',
            q: val,
            callback: 'dealData'
        },
        dataType: 'jsonp',
    })
});
// 渲染搜索框结果列表
function dealData(data) {
    console.log(data);
    $('#search-helper').empty();
    data = data.result;
    data.forEach(function(item) {
        $('<li>' + item[0] + '</li>').appendTo($('#search-helper'));
    })
    $('#search-helper').show();
}
//  防抖
var searchTimer = null;
// 搜索框输入事件
$('#search-inp').keyup(function(e) {
    clearTimeout(searchTimer);
    searchTimer = setTimeout(function() {
        $('.search-btn').trigger('click');
    }, 300);
});
$('.search-box').mouseleave(function() {
    $('#search-helper').hide();
}).click(function() {
    if ($('#search-inp').val()) {
        $('#search-helper').show();
    }
}).find('#search-inp').focus(function(e) {
    e.preventDefault();
    if ($('#search-inp').val()) {
        $('#search-helper').show();
    }
});





$('.sk-mid').swiper({
    imgList: ['https://img13.360buyimg.com/seckillcms/s280x280_jfs/t1/128979/11/13976/177369/5f75b20dEca347f92/c7ef2a6466fa2fad.jpg.webp',
        'https://img14.360buyimg.com/seckillcms/s280x280_jfs/t1/147328/8/9449/170269/5f72a6caE72c7cabd/2fa21c5a2820d528.jpg.webp',
        'https://img11.360buyimg.com/mobilecms/s140x140_jfs/t1/24602/40/14233/166462/5ca57073E385a8e7c/b314d226c4216c99.png!q90.webp',
        'https://img11.360buyimg.com/mobilecms/s140x140_jfs/t26674/132/1799437842/185954/e68a4b67/5bee21edN5ec04279.jpg!q90.webp'
    ],
    isAuto: false,
    showImgWidth: 800,
    imgWidth: 200,
    animateType: 'animate',
});
$('.sk-right').swiper({
    imgList: ['https://img13.360buyimg.com/seckillcms/s280x280_jfs/t1/129680/22/12064/132248/5f7fd89cE7a6b16c8/8348a213e2567107.jpg.webp',
        'https://img14.360buyimg.com/seckillcms/s280x280_jfs/t1/147328/8/9449/170269/5f72a6caE72c7cabd/2fa21c5a2820d528.jpg.webp',
    ],
    isAuto: true,
    animateType: 'animate',

});